// Задача 19. Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

Console.Clear ();
Console.WriteLine ("Введите пятизначное число: ");
int count = array.Length;

for(int i=0; i<count; i++)


Console.WriteLine("Это палиндром");

Console.WriteLine("Нет, это не палиндром");